backg/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



vertices
(
    (-2.5 -0.5001 -2.228 )
    (5.011 -0.5001 -2.228 )
    (5.011 0.5001 -2.228 )
    (-2.5 0.5001 -2.228  )
    (-2.5 -0.5001 2.772 )
    (5.011 -0.5001 2.772 )
    (5.011  0.5001 2.772 )
    (-2.5  0.5001 2.772 )
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 20 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

    
    inlet
    {
        type patch;
        faces
        (
            (3 0 4 7)
           
        );
    }
     top
    {
        type symmetryPlane;
        faces
        (
            
            (4 5 6 7)

            
             

        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            
            

            
             (0 3 2 1)

        );
    }


    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    front
    {
        type symmetryPlane;
        faces
        (
              (0 1 5 4)
        );
    }

    back
    {
        type symmetryPlane;
        faces
        (
            
            (2 3 7 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
