backg/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync true;

patches
(    {
        //- Slave side patch
        name            front;
        patchInfo
        {
            type            empty;
          
        }
        constructFrom patches;
        patches (front front_flap);
    }
       {
        //- Slave side patch
        name            back;
        patchInfo
        {
            type            empty;
          
        }
        constructFrom patches;
        patches (back back_flap);
    }
     {
        //- Slave side patch
        name            overset;
        patchInfo
        {
            type            overset;
          
        }
        constructFrom patches;
        patches (overset overset_slave);
    }


);

// ************************************************************************* //
